Repository: giellalt/corpus-nob
Catalog: tmx/sme/admin/sd/samediggi.no/sandra-marja-west.html.tmx
Source language: nob
Languages: sme

source: Sandra Márjá West / Representanter / Om Sametinget / Forsiden - Sametinget
sme: Sandra Márjá West / Áirasat / Sámedikki birra / Sámediggi - Sametinget

source: Fødselsdato:
sme: Sandra Márjá West

source: Yrke
sme: NSR

source: Samisk veiviser, Samisk Høgskole
sme: sandra.marja.west@samediggi.no

source: Medarbeider ved Tromsø Museum
sme: Varamedlem i Riddu Riđđu Festival

source: Assistent ved Universitetet i Tromsø
sme: Varamedlem i Riddu Riđđu Searvi
